# RemoveElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..RemoveElementIds Method
StructuralConnectionHandler Class See Also
---
Removes element ids from the connection. All element ids in an array should belong to the connection.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void RemoveElementIds(
	IList<ElementId> elemIds
)
```

Visual Basic
---
```text
Public Sub RemoveElementIds ( _
	elemIds As IList(Of ElementId) _
)
```

Visual C++
---
```text
public:
void RemoveElementIds(
	IList<ElementId^>^ elemIds
)
```

# ### Parameters
elemIds
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> The ElementIdArr containing ids of elements to be removed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | One or more element ids was not permitted to be removed from the connection. Elements should be members of the connection. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace